Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.59/PIC32CM-JH01/atdf/PIC32CM2532JH01032.atdf
<?xml version="1.0"?>
<!--
 Copyright (c) 2019 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.4" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2020-08-03T13:07:17Z"/>
  <variants xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
    <variant ordercode="PIC32CM2532JH01032-I/PT" mhc:ordercode="PIC32CM2532JH01032-I/PT" package="TQFP32" pinout="CMJH32" speedmax="48000000" tempmin="-40" tempmax="85" vccmin="2.7" vccmax="5.5"/>
    <variant ordercode="PIC32CM2532JH01032-E/PT" mhc:ordercode="PIC32CM2532JH01032-E/PT" package="TQFP32" pinout="CMJH32" speedmax="48000000" tempmin="-40" tempmax="125" vccmin="2.7" vccmax="5.5"/>
  </variants>
  <devices>
    <device name="PIC32CM2532JH01032" architecture="CORTEX-M0PLUS" family="PIC32CM" series="PIC32CMJH01">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="FLASH" start="0x00000000" size="0x40000" type="flash" pagesize="64" rw="RW" exec="true"/>
          <memory-segment name="CAL" start="0x00800000" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="LOCKBIT" start="0x00802000" size="0x4" type="fuses" rw="R"/>
          <memory-segment name="OTP1" start="0x00806000" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="OTP2" start="0x00806008" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="OTP3" start="0x00806010" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="OTP4" start="0x00806018" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="OTP5" start="0x00806020" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="TEMP_LOG" start="0x00806030" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW"/>
          <memory-segment name="DATAFLASH" start="0x00400000" size="0x2000" type="flash" pagesize="64" rw="RW" exec="true"/>
          <memory-segment name="DRAM" start="0x20000000" size="0x8000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HPB0" start="0x40000000" size="0x4000" type="io" rw="RW"/>
          <memory-segment name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW"/>
          <memory-segment name="HPB2" start="0x42000000" size="0x8000" type="io" rw="RW"/>
          <memory-segment name="HPB3" start="0x43000000" size="0x1800" type="io" rw="RW"/>
          <memory-segment name="DIVAS" start="0x48000000" size="0x20" type="io" rw="RW"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW"/>
        </address-space>
        <address-space id="fuses" name="fuses" start="0x00000000" size="0x20000000" endianness="little"/>
      </address-spaces>
      <parameters>
        <param name="NUM_IRQ" value="32" caption="Number of interrupt request lines"/>
        <param name="__CM0P_REV" value="0x0001" caption="Cortex-M0+ Core Revision"/>
        <param name="__MPU_PRESENT" value="1" caption="MPU present or not"/>
        <param name="__NVIC_PRIO_BITS" value="2" caption="Number of Bits used for Priority Levels"/>
        <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present or not"/>
        <param name="__Vendor_SysTickConfig" value="0" caption="Set to 1 if different SysTick Config is used"/>
        <param name="__ARCH_ARM" value="1"/>
        <param name="__ARCH_ARM_CORTEX_M" value="1"/>
      </parameters>
      <peripherals>
        <module name="AC" id="U2245" version="1.1.1">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x42004C00"/>
            <signals>
              <signal group="AIN" index="0" function="B" pad="PA04"/>
              <signal group="AIN" index="1" function="B" pad="PA05"/>
              <signal group="AIN" index="2" function="B" pad="PA06"/>
              <signal group="AIN" index="3" function="B" pad="PA07"/>
              <signal group="AIN" index="4" function="B" pad="PA02"/>
              <signal group="AIN" index="5" function="B" pad="PA03"/>
              <signal group="CMP" index="0" function="H" pad="PA18"/>
              <signal group="CMP" index="1" function="H" pad="PA19"/>
              <signal group="CMP" index="2" function="H" pad="PA00"/>
              <signal group="CMP" index="2" function="H" pad="PA24"/>
              <signal group="CMP" index="3" function="H" pad="PA01"/>
              <signal group="CMP" index="3" function="H" pad="PA25"/>
            </signals>
            <parameters>
              <param name="COMPCTRL_MUXNEG_OPAMP" value="7" caption="OPAMP selection for MUXNEG"/>
              <param name="GCLK_ID" value="42" caption="Index of Generic Clock"/>
              <param name="NUM_CMP" value="4" caption="Number of comparators"/>
              <param name="PAIRS" value="2" caption="Number of pairs of comparators"/>
              <param name="SPEED_LEVELS" value="2" caption="Number of speed values"/>
              <param name="INSTANCE_ID" value="83" caption="Instance index for AC"/>
            </parameters>
          </instance>
        </module>
        <module name="ADC" id="U2247" version="2.4.0">
          <instance name="ADC0">
            <register-group name="ADC0" name-in-module="ADC" address-space="base" offset="0x42004400"/>
            <signals>
              <signal group="AIN" index="0" function="B" pad="PA02"/>
              <signal group="AIN" index="1" function="B" pad="PA03"/>
              <signal group="AIN" index="4" function="B" pad="PA04"/>
              <signal group="AIN" index="5" function="B" pad="PA05"/>
              <signal group="AIN" index="6" function="B" pad="PA06"/>
              <signal group="AIN" index="7" function="B" pad="PA07"/>
              <signal group="AIN" index="8" function="B" pad="PA08"/>
              <signal group="AIN" index="9" function="B" pad="PA09"/>
              <signal group="AIN" index="10" function="B" pad="PA10"/>
              <signal group="AIN" index="11" function="B" pad="PA11"/>
              <signal group="VREFP" function="B" pad="PA03"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RESRDY" value="42" caption="Index of DMA RESRDY trigger"/>
              <param name="EXTCHANNEL_MSB" value="11" caption="Number of external channels"/>
              <param name="GCLK_ID" value="36" caption="Index of Generic Clock"/>
              <param name="INT_CH30" value="0" caption="Select OPAMP or CTAT on Channel 30"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="ADC Master/Slave Mode"/>
              <param name="INSTANCE_ID" value="81" caption="Instance index for ADC0"/>
              <param name="LOAD_CALIB" value="1" caption="CALIB register to be loaded from NVM"/>
            </parameters>
          </instance>
          <instance name="ADC1">
            <register-group name="ADC1" name-in-module="ADC" address-space="base" offset="0x42004800"/>
            <signals>
              <signal group="AIN" index="10" function="B" pad="PA08"/>
              <signal group="AIN" index="11" function="B" pad="PA09"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RESRDY" value="43" caption="Index of DMA RESRDY trigger"/>
              <param name="EXTCHANNEL_MSB" value="11" caption="Number of external channels"/>
              <param name="GCLK_ID" value="37" caption="Index of Generic Clock"/>
              <param name="INT_CH30" value="0" caption="Select OPAMP or CTAT on Channel 30"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="ADC Master/Slave Mode"/>
              <param name="INSTANCE_ID" value="82" caption="Instance index for ADC1"/>
              <param name="LOAD_CALIB" value="1" caption="CALIB register to be loaded from NVM"/>
            </parameters>
          </instance>
        </module>
        <module name="CAN" id="U2003" version="2.1.0">
          <instance name="CAN0">
            <register-group name="CAN0" name-in-module="CAN" address-space="base" offset="0x42001C00"/>
            <signals>
              <signal group="RX" function="G" pad="PA25"/>
              <signal group="TX" function="G" pad="PA24"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_DEBUG" value="14" caption="DMA CAN Debug Req"/>
              <param name="GCLK_ID" value="26" caption="Index of Generic Clock"/>
              <param name="MSG_RAM_ADDR" value="0x200000000"/>
              <param name="QOS_RESET_VAL" value="2" caption="QOS reset value"/>
              <param name="INSTANCE_ID" value="71" caption="Instance index for CAN0"/>
            </parameters>
          </instance>
        </module>
        <module name="CCL" id="U2225" version="2.0.0">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x42005800"/>
            <signals>
              <signal group="IN" index="0" function="I" pad="PA04"/>
              <signal group="IN" index="0" function="I" pad="PA16"/>
              <signal group="IN" index="1" function="I" pad="PA05"/>
              <signal group="IN" index="1" function="I" pad="PA17"/>
              <signal group="IN" index="2" function="I" pad="PA06"/>
              <signal group="IN" index="2" function="I" pad="PA18"/>
              <signal group="IN" index="3" function="I" pad="PA08"/>
              <signal group="IN" index="3" function="I" pad="PA30"/>
              <signal group="IN" index="4" function="I" pad="PA09"/>
              <signal group="IN" index="5" function="I" pad="PA10"/>
              <signal group="IN" index="6" function="I" pad="PA22"/>
              <signal group="IN" index="7" function="I" pad="PA23"/>
              <signal group="IN" index="8" function="I" pad="PA24"/>
              <signal group="OUT" index="0" function="I" pad="PA07"/>
              <signal group="OUT" index="0" function="I" pad="PA19"/>
              <signal group="OUT" index="1" function="I" pad="PA11"/>
              <signal group="OUT" index="1" function="I" pad="PA31"/>
              <signal group="OUT" index="2" function="I" pad="PA25"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="40" caption="GCLK index for CCL"/>
              <param name="LUT_NUM" value="4" caption="Number of LUT in a CCL"/>
              <param name="SEQ_NUM" value="2" caption="Number of SEQ in a CCL"/>
              <param name="INSTANCE_ID" value="86" caption="Instance index for CCL"/>
            </parameters>
          </instance>
        </module>
        <module name="DAC" id="U2214" version="2.1.0">
          <instance name="DAC">
            <register-group name="DAC" name-in-module="DAC" address-space="base" offset="0x42005000"/>
            <signals>
              <signal group="VOUT" function="B" pad="PA02"/>
              <signal group="VREFP" function="B" pad="PA03"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_EMPTY" value="45" caption="Index of DMA EMPTY trigger"/>
              <param name="GCLK_ID" value="38"/>
              <param name="INSTANCE_ID" value="84" caption="Instance index for DAC"/>
            </parameters>
          </instance>
        </module>
        <module name="DIVAS" id="U2258" version="1.0.0">
          <instance name="DIVAS">
            <register-group name="DIVAS" name-in-module="DIVAS" address-space="base" offset="0x48000000"/>
            <register-group name="DIVAS_IOBUS" name-in-module="DIVAS" address-space="base" offset="0x60000200"/>
