Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.59/PIC32CM-JH01/atdf/PIC32CM2532JH01032.atdf
        <register name="INTFLAGB" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAGB" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge B">
          <bitfield name="PORT_" caption="PORT" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC" mask="0x8"/>
          <bitfield name="MTB_" caption="MTB" mask="0x10"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS" mask="0x20"/>
        </register>
        <register name="INTFLAGC" offset="0x1C" rw="RW" size="4" atomic-op="clear:INTFLAGC" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge C">
          <bitfield name="EVSYS_" caption="EVSYS" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1" mask="0x4"/>
          <bitfield name="SERCOM2_" caption="SERCOM2" mask="0x8"/>
          <bitfield name="SERCOM3_" caption="SERCOM3" mask="0x10"/>
          <bitfield name="CAN0_" caption="CAN0" mask="0x80"/>
          <bitfield name="TCC0_" caption="TCC0" mask="0x200"/>
          <bitfield name="TCC1_" caption="TCC1" mask="0x400"/>
          <bitfield name="TCC2_" caption="TCC2" mask="0x800"/>
          <bitfield name="TC0_" caption="TC0" mask="0x1000"/>
          <bitfield name="TC1_" caption="TC1" mask="0x2000"/>
          <bitfield name="TC2_" caption="TC2" mask="0x4000"/>
          <bitfield name="TC3_" caption="TC3" mask="0x8000"/>
          <bitfield name="TC4_" caption="TC4" mask="0x10000"/>
          <bitfield name="ADC0_" caption="ADC0" mask="0x20000"/>
          <bitfield name="ADC1_" caption="ADC1" mask="0x40000"/>
          <bitfield name="AC_" caption="AC" mask="0x80000"/>
          <bitfield name="DAC_" caption="DAC" mask="0x100000"/>
          <bitfield name="PTC_" caption="PTC" mask="0x200000"/>
          <bitfield name="CCL_" caption="CCL" mask="0x400000"/>
          <bitfield name="ICM_" caption="ICM" mask="0x2000000"/>
          <bitfield name="PDEC_" caption="PDEC" mask="0x4000000"/>
          <bitfield name="SMBIST_" caption="SMBIST" mask="0x8000000"/>
        </register>
        <register name="INTFLAGD" offset="0x20" rw="RW" size="4" atomic-op="clear:INTFLAGD" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge D">
          <bitfield name="TC5_" caption="TC5" mask="0x4"/>
          <bitfield name="TC6_" caption="TC6" mask="0x8"/>
          <bitfield name="TC7_" caption="TC7" mask="0x10"/>
        </register>
        <register name="STATUSA" offset="0x34" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge A">
          <bitfield name="PAC_" caption="PAC APB Protect Enable" mask="0x1"/>
          <bitfield name="PM_" caption="PM APB Protect Enable" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK APB Protect Enable" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC APB Protect Enable" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Protect Enable" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Protect Enable" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC APB Protect Enable" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK APB Protect Enable" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT APB Protect Enable" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC APB Protect Enable" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC APB Protect Enable" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM APB Protect Enable" mask="0x800"/>
          <bitfield name="MCRAMC_" caption="MCRAMC APB Protect Enable" mask="0x1000"/>
        </register>
        <register name="STATUSB" offset="0x38" rw="R" size="4" initval="0x00000002" caption="Peripheral write protection status - Bridge B">
          <bitfield name="PORT_" caption="PORT APB Protect Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Protect Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Protect Enable" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC APB Protect Enable" mask="0x8"/>
          <bitfield name="MTB_" caption="MTB APB Protect Enable" mask="0x10"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS APB Protect Enable" mask="0x20"/>
        </register>
        <register name="STATUSC" offset="0x3C" rw="R" size="4" initval="0x09000000" caption="Peripheral write protection status - Bridge C">
          <bitfield name="EVSYS_" caption="EVSYS APB Protect Enable" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Protect Enable" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Protect Enable" mask="0x4"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Protect Enable" mask="0x8"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Protect Enable" mask="0x10"/>
          <bitfield name="CAN0_" caption="CAN0 APB Protect Enable" mask="0x80"/>
          <bitfield name="TCC0_" caption="TCC0 APB Protect Enable" mask="0x200"/>
          <bitfield name="TCC1_" caption="TCC1 APB Protect Enable" mask="0x400"/>
          <bitfield name="TCC2_" caption="TCC2 APB Protect Enable" mask="0x800"/>
          <bitfield name="TC0_" caption="TC0 APB Protect Enable" mask="0x1000"/>
          <bitfield name="TC1_" caption="TC1 APB Protect Enable" mask="0x2000"/>
          <bitfield name="TC2_" caption="TC2 APB Protect Enable" mask="0x4000"/>
          <bitfield name="TC3_" caption="TC3 APB Protect Enable" mask="0x8000"/>
          <bitfield name="TC4_" caption="TC4 APB Protect Enable" mask="0x10000"/>
          <bitfield name="ADC0_" caption="ADC0 APB Protect Enable" mask="0x20000"/>
          <bitfield name="ADC1_" caption="ADC1 APB Protect Enable" mask="0x40000"/>
          <bitfield name="AC_" caption="AC APB Protect Enable" mask="0x80000"/>
          <bitfield name="DAC_" caption="DAC APB Protect Enable" mask="0x100000"/>
          <bitfield name="PTC_" caption="PTC APB Protect Enable" mask="0x200000"/>
          <bitfield name="CCL_" caption="CCL APB Protect Enable" mask="0x400000"/>
          <bitfield name="ICM_" caption="ICM APB Protect Enable" mask="0x2000000"/>
          <bitfield name="PDEC_" caption="PDEC APB Protect Enable" mask="0x4000000"/>
          <bitfield name="SMBIST_" caption="SMBIST APB Protect Enable" mask="0x8000000"/>
        </register>
        <register name="STATUSD" offset="0x40" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge D">
          <bitfield name="TC5_" caption="TC5 APB Protect Enable" mask="0x4"/>
          <bitfield name="TC6_" caption="TC6 APB Protect Enable" mask="0x8"/>
          <bitfield name="TC7_" caption="TC7 APB Protect Enable" mask="0x10"/>
        </register>
      </register-group>
      <value-group name="PAC_WRCTRL__KEY">
        <value name="OFF" caption="No action" value="0"/>
        <value name="CLR" caption="Clear protection" value="1"/>
        <value name="SET" caption="Set protection" value="2"/>
        <value name="SETLCK" caption="Set and lock protection" value="3"/>
      </value-group>
    </module>
    <module name="PDEC" id="U2263" version="1.0.0" caption="Quadrature Decodeur">
      <register-group name="PDEC" caption="Quadrature Decodeur">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operation Mode" mask="0xC" values="PDEC_CTRLA__MODE"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="CONF" caption="PDEC Configuration" mask="0x700" values="PDEC_CTRLA__CONF"/>
          <bitfield name="ALOCK" caption="Auto Lock" mask="0x800"/>
          <bitfield name="SWAP" caption="PDEC Phase A and B Swap" mask="0x4000"/>
          <bitfield name="PEREN" caption="Period Enable" mask="0x8000"/>
          <bitfield name="PINEN0" caption="PDEC Input From Pin 0 Enable" mask="0x10000"/>
          <bitfield name="PINEN1" caption="PDEC Input From Pin 1 Enable" mask="0x20000"/>
          <bitfield name="PINEN2" caption="PDEC Input From Pin 2 Enable" mask="0x40000"/>
          <bitfield name="PINVEN0" caption="IO Pin 0 Invert Enable" mask="0x100000"/>
          <bitfield name="PINVEN1" caption="IO Pin 1 Invert Enable" mask="0x200000"/>
          <bitfield name="PINVEN2" caption="IO Pin 2 Invert Enable" mask="0x400000"/>
          <bitfield name="ANGULAR" caption="Angular Counter Length" mask="0x7000000"/>
          <bitfield name="MAXCMP" caption="Maximum Consecutive Missing Pulses" mask="0xF0000000"/>
        </register>
        <register name="CTRLBCLR" offset="0x4" rw="RW" access="RWSYNC" size="1" atomic-op="clear:CTRLBCLR" initval="0x00" caption="Control B Clear">
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="CMD" caption="Command" mask="0xE0" values="PDEC_CTRLBCLR__CMD"/>
        </register>
        <register name="CTRLBSET" offset="0x5" rw="RW" access="RWSYNC" size="1" atomic-op="set:CTRLBSET" initval="0x00" caption="Control B Set">
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="CMD" caption="Command" mask="0xE0" values="PDEC_CTRLBSET__CMD"/>
        </register>
